app/controllers/images_controller.rb

SELECT `images`.* FROM `images`
---
  def index
    @images = Image.all # instance variables are prefixed with an @, to access images in the template